ranjithaguna/pv/LED_Demo/source/pic32cx/component/hdmi_cec.h
/**
 * \brief Component description for PIC32CX/0525SG12 HDMI_CEC
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_HDMI_CEC_COMPONENT_H_
#define _PIC32CX_0525SG12_HDMI_CEC_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_HDMI_CEC The HDMI Consumer Electronics Control (CEC) Interface that provides high-level control functions between all of the        various audiovisual products in a users environment.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR HDMI_CEC */
/* ========================================================================== */

/* -------- HDMI_CEC_HDMICEC_CTRL : (HDMI_CEC Offset: 0x00) (R/W 8) HDMI CEC Control Register.     Only bits [3:0] are used. Bits [31:4] are Reserved. -------- */

typedef union
{
  struct
  {
    uint8_t  ACTIVATE:1;                /**< bit:      0  Enable the blocks operation. (R/W)\n                1=The block is enabled for normal operation.\n                0=The block is disabled and placed in its lowest power state. */
    uint8_t  RESET:1;                   /**< bit:      1  Soft reset the entire module. This bit is self-clearing. */
    uint8_t  FLTEN:1;                   /**< bit:      2  1=Filtering on the CEC bus is enabled.\n       0=Filtering is disabled */
    uint8_t  SFT5:1;                    /**< bit:      3  When this bit is written to '1', the Signal Free Time (SFT) is changed                    to '5' once only.\n This bit is cleared and normal SFT behavior resumes when the Bus                    Idle condition is asserted. */
    uint8_t  :4;                        /**< bit:   4..7  Reserved                                      */
  };
  uint8_t  w;
} __HDMI_CEC_HDMICEC_CTRL_bits_t;
#define HDMI_CEC_HDMICEC_CTRL_RESETVALUE    (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_CTRL) HDMI CEC Control Register.     Only bits [3:0] are used. Bits [31:4] are Reserved.  Reset Value */

#define HDMI_CEC_HDMICEC_CTRL_ACTIVATE_Pos    (0)                                            /**< (HDMI_CEC_HDMICEC_CTRL) Enable the blocks operation. (R/W)\n                1=The block is enabled for normal operation.\n                0=The block is disabled and placed in its lowest power state. Position */
#define HDMI_CEC_HDMICEC_CTRL_ACTIVATE_Msk    (0x1U << HDMI_CEC_HDMICEC_CTRL_ACTIVATE_Pos)   /**< (HDMI_CEC_HDMICEC_CTRL) Enable the blocks operation. (R/W)\n                1=The block is enabled for normal operation.\n                0=The block is disabled and placed in its lowest power state. Mask */
#define HDMI_CEC_HDMICEC_CTRL_RESET_Pos       (1)                                            /**< (HDMI_CEC_HDMICEC_CTRL) Soft reset the entire module. This bit is self-clearing. Position */
#define HDMI_CEC_HDMICEC_CTRL_RESET_Msk       (0x1U << HDMI_CEC_HDMICEC_CTRL_RESET_Pos)      /**< (HDMI_CEC_HDMICEC_CTRL) Soft reset the entire module. This bit is self-clearing. Mask */
#define HDMI_CEC_HDMICEC_CTRL_FLTEN_Pos       (2)                                            /**< (HDMI_CEC_HDMICEC_CTRL) 1=Filtering on the CEC bus is enabled.\n       0=Filtering is disabled Position */
#define HDMI_CEC_HDMICEC_CTRL_FLTEN_Msk       (0x1U << HDMI_CEC_HDMICEC_CTRL_FLTEN_Pos)      /**< (HDMI_CEC_HDMICEC_CTRL) 1=Filtering on the CEC bus is enabled.\n       0=Filtering is disabled Mask */
#define HDMI_CEC_HDMICEC_CTRL_SFT5_Pos        (3)                                            /**< (HDMI_CEC_HDMICEC_CTRL) When this bit is written to '1', the Signal Free Time (SFT) is changed                    to '5' once only.\n This bit is cleared and normal SFT behavior resumes when the Bus                    Idle condition is asserted. Position */
#define HDMI_CEC_HDMICEC_CTRL_SFT5_Msk        (0x1U << HDMI_CEC_HDMICEC_CTRL_SFT5_Pos)       /**< (HDMI_CEC_HDMICEC_CTRL) When this bit is written to '1', the Signal Free Time (SFT) is changed                    to '5' once only.\n This bit is cleared and normal SFT behavior resumes when the Bus                    Idle condition is asserted. Mask */
#define HDMI_CEC_HDMICEC_CTRL_Msk             (0x0000000FUL)                                 /**< (HDMI_CEC_HDMICEC_CTRL) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_LAR : (HDMI_CEC Offset: 0x04) (R/ 16) HDMI CEC Claimed Logical Address Register.     Only bits [15:0] are used. Bits [31:16] are Reserved. -------- */

typedef union
{
  struct
  {
    uint16_t ADDR:16;                   /**< bit:  0..15  When any bit in this register is asserted ('1'), Follower Directed Messages                  and Follower Broadcast Messages addressed to that logical                  address are claimed by the Follower Interface. The Claimed Logical                  Address Register default effectively disables the Follower Interface. */
  };
  uint16_t w;
} __HDMI_CEC_HDMICEC_LAR_bits_t;
#define HDMI_CEC_HDMICEC_LAR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_LAR) HDMI CEC Claimed Logical Address Register.     Only bits [15:0] are used. Bits [31:16] are Reserved.  Reset Value */

#define HDMI_CEC_HDMICEC_LAR_ADDR_Pos         (0)                                            /**< (HDMI_CEC_HDMICEC_LAR) When any bit in this register is asserted ('1'), Follower Directed Messages                  and Follower Broadcast Messages addressed to that logical                  address are claimed by the Follower Interface. The Claimed Logical                  Address Register default effectively disables the Follower Interface. Position */
#define HDMI_CEC_HDMICEC_LAR_ADDR_Msk         (0xFFFFU << HDMI_CEC_HDMICEC_LAR_ADDR_Pos)     /**< (HDMI_CEC_HDMICEC_LAR) When any bit in this register is asserted ('1'), Follower Directed Messages                  and Follower Broadcast Messages addressed to that logical                  address are claimed by the Follower Interface. The Claimed Logical                  Address Register default effectively disables the Follower Interface. Mask */
#define HDMI_CEC_HDMICEC_LAR_ADDR(value)      (HDMI_CEC_HDMICEC_LAR_ADDR_Msk & ((value) << HDMI_CEC_HDMICEC_LAR_ADDR_Pos))
#define HDMI_CEC_HDMICEC_LAR_Msk              (0x0000FFFFUL)                                 /**< (HDMI_CEC_HDMICEC_LAR) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_IDR : (HDMI_CEC Offset: 0x08) (/W 16) HDMI CEC Initiator Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved. -------- */

typedef union
{
  struct
  {
    uint16_t INITIATOR_DATA:8;          /**< bit:   0..7  When any bit in this register is asserted ('1'), Follower Directed Messages                     and Follower Broadcast Messages addressed to that logical                     address are claimed by the Follower Interface. The Claimed Logical                     Address Register default effectively disables the Follower Interface.                     Reads of this field return 0. */
    uint16_t EOM:1;                     /**< bit:      8  This bit is used for the End of Message bit in header/data blocks in                    CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete.                    Reads of this field return 0. */
    uint16_t :7;                        /**< bit:  9..15  Reserved                                      */
  };
  uint16_t w;
} __HDMI_CEC_HDMICEC_IDR_bits_t;
