ranjithaguna/pv/LED_Demo/source/pic32cx/component/hdmi_cec.h
#define HDMI_CEC_HDMICEC_IDR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_IDR) HDMI CEC Initiator Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved.  Reset Value */

#define HDMI_CEC_HDMICEC_IDR_INITIATOR_DATA_Pos (0)                                            /**< (HDMI_CEC_HDMICEC_IDR) When any bit in this register is asserted ('1'), Follower Directed Messages                     and Follower Broadcast Messages addressed to that logical                     address are claimed by the Follower Interface. The Claimed Logical                     Address Register default effectively disables the Follower Interface.                     Reads of this field return 0. Position */
#define HDMI_CEC_HDMICEC_IDR_INITIATOR_DATA_Msk (0xFFU << HDMI_CEC_HDMICEC_IDR_INITIATOR_DATA_Pos)  /**< (HDMI_CEC_HDMICEC_IDR) When any bit in this register is asserted ('1'), Follower Directed Messages                     and Follower Broadcast Messages addressed to that logical                     address are claimed by the Follower Interface. The Claimed Logical                     Address Register default effectively disables the Follower Interface.                     Reads of this field return 0. Mask */
#define HDMI_CEC_HDMICEC_IDR_INITIATOR_DATA(value) (HDMI_CEC_HDMICEC_IDR_INITIATOR_DATA_Msk & ((value) << HDMI_CEC_HDMICEC_IDR_INITIATOR_DATA_Pos))
#define HDMI_CEC_HDMICEC_IDR_EOM_Pos          (8)                                            /**< (HDMI_CEC_HDMICEC_IDR) This bit is used for the End of Message bit in header/data blocks in                    CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete.                    Reads of this field return 0. Position */
#define HDMI_CEC_HDMICEC_IDR_EOM_Msk          (0x1U << HDMI_CEC_HDMICEC_IDR_EOM_Pos)         /**< (HDMI_CEC_HDMICEC_IDR) This bit is used for the End of Message bit in header/data blocks in                    CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete.                    Reads of this field return 0. Mask */
#define HDMI_CEC_HDMICEC_IDR_Msk              (0x000001FFUL)                                 /**< (HDMI_CEC_HDMICEC_IDR) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_FDR : (HDMI_CEC Offset: 0x0c) (R/ 16) HDMI CEC Follower Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved. -------- */

typedef union
{
  struct
  {
    uint16_t FOLLOWER_DATA:8;           /**< bit:   0..7  This field is used for the received Information bits from header/data                    blocks in CEC message frames.\n                    Reads of this register when the FFNE bit in the Follower Status Register                    is not asserted ('0') return undefined data. */
    uint16_t EOM:1;                     /**< bit:      8  This bit is the received End of Message bit from header/data blocks                    in CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete. */
    uint16_t :7;                        /**< bit:  9..15  Reserved                                      */
  };
  uint16_t w;
} __HDMI_CEC_HDMICEC_FDR_bits_t;
#define HDMI_CEC_HDMICEC_FDR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_FDR) HDMI CEC Follower Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved.  Reset Value */

#define HDMI_CEC_HDMICEC_FDR_FOLLOWER_DATA_Pos (0)                                            /**< (HDMI_CEC_HDMICEC_FDR) This field is used for the received Information bits from header/data                    blocks in CEC message frames.\n                    Reads of this register when the FFNE bit in the Follower Status Register                    is not asserted ('0') return undefined data. Position */
#define HDMI_CEC_HDMICEC_FDR_FOLLOWER_DATA_Msk (0xFFU << HDMI_CEC_HDMICEC_FDR_FOLLOWER_DATA_Pos)  /**< (HDMI_CEC_HDMICEC_FDR) This field is used for the received Information bits from header/data                    blocks in CEC message frames.\n                    Reads of this register when the FFNE bit in the Follower Status Register                    is not asserted ('0') return undefined data. Mask */
#define HDMI_CEC_HDMICEC_FDR_FOLLOWER_DATA(value) (HDMI_CEC_HDMICEC_FDR_FOLLOWER_DATA_Msk & ((value) << HDMI_CEC_HDMICEC_FDR_FOLLOWER_DATA_Pos))
#define HDMI_CEC_HDMICEC_FDR_EOM_Pos          (8)                                            /**< (HDMI_CEC_HDMICEC_FDR) This bit is the received End of Message bit from header/data blocks                    in CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete. Position */
#define HDMI_CEC_HDMICEC_FDR_EOM_Msk          (0x1U << HDMI_CEC_HDMICEC_FDR_EOM_Pos)         /**< (HDMI_CEC_HDMICEC_FDR) This bit is the received End of Message bit from header/data blocks                    in CEC message frames. When the bit is '0' more data blocks follow;                    a '1' specifies that the message is complete. Mask */
#define HDMI_CEC_HDMICEC_FDR_Msk              (0x000001FFUL)                                 /**< (HDMI_CEC_HDMICEC_FDR) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_ISR : (HDMI_CEC Offset: 0x10) (R/W 8) HDMI CEC Initiator Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. -------- */

typedef union
{
  struct
  {
    uint8_t  IDLE:1;                    /**< bit:      0  1=The CEC bus is idle.              0=The CEC bus is busy. */
    uint8_t  LAB:1;                     /**< bit:      1  Lost Arbitration (LAB).                    1=Bus contention is detected by the Initiator Interface during CEC line arbitration.                    0=No bus contention detected.                    R/WC. */
    uint8_t  UNDRN:1;                   /**< bit:      2  Initiator Underrun (UNDRN)        1=The Initiator shift register requires data from the Initiator Interface                        FIFO and the IFE bit is asserted.          0=No underrun detected.          R/WC. */
    uint8_t  ACKERR:1;                  /**< bit:      3  The Acknowledge Error bit is asserted ('1') when the follower NACKs                     an acknowledge bit, both for Follower Directed Messages and Follower                     Broadcast Messages.                     For example, in Follower Directed Messages if the follower acknowledge                     bit response is '1' this bit is '1' in Follower Broadcast Messages                     if a follower acknowledge bit response is '0' the bit is '1'. */
    uint8_t  CE:1;                      /**< bit:      4  The Contention Error bit is asserted ('1') when bus contention is                     detected by the Initiator Interface at any point following CEC line                     arbitration. This is likely to be a consequence of CEC Line Error                     Handling (see CEC 7.4, CEC Line Error Handling in References [1]).       R/WC. */
    uint8_t  IFE:1;                     /**< bit:      5  The Initiator FIFO Empty bit is asserted ('1') when the Initiator Interface                     retrieves the last data entry from the FIFO. */
    uint8_t  IFDONE:1;                  /**< bit:      6  The Initiator Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been transferred by the Initiator                     Interface, or the message frame has been terminated because an                     error occurred as defined by the LAB, UNDRN, ACKERR, and CE bits.        R/WC. */
    uint8_t  :1;                        /**< bit:      7  Reserved                                      */
  };
  uint8_t  w;
} __HDMI_CEC_HDMICEC_ISR_bits_t;
#define HDMI_CEC_HDMICEC_ISR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_ISR) HDMI CEC Initiator Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.  Reset Value */

