ranjithaguna/pv/LED_Demo/source/pic32cx/component/hdmi_cec.h
#define HDMI_CEC_HDMICEC_ISR_IDLE_Pos         (0)                                            /**< (HDMI_CEC_HDMICEC_ISR) 1=The CEC bus is idle.              0=The CEC bus is busy. Position */
#define HDMI_CEC_HDMICEC_ISR_IDLE_Msk         (0x1U << HDMI_CEC_HDMICEC_ISR_IDLE_Pos)        /**< (HDMI_CEC_HDMICEC_ISR) 1=The CEC bus is idle.              0=The CEC bus is busy. Mask */
#define HDMI_CEC_HDMICEC_ISR_LAB_Pos          (1)                                            /**< (HDMI_CEC_HDMICEC_ISR) Lost Arbitration (LAB).                    1=Bus contention is detected by the Initiator Interface during CEC line arbitration.                    0=No bus contention detected.                    R/WC. Position */
#define HDMI_CEC_HDMICEC_ISR_LAB_Msk          (0x1U << HDMI_CEC_HDMICEC_ISR_LAB_Pos)         /**< (HDMI_CEC_HDMICEC_ISR) Lost Arbitration (LAB).                    1=Bus contention is detected by the Initiator Interface during CEC line arbitration.                    0=No bus contention detected.                    R/WC. Mask */
#define HDMI_CEC_HDMICEC_ISR_UNDRN_Pos        (2)                                            /**< (HDMI_CEC_HDMICEC_ISR) Initiator Underrun (UNDRN)        1=The Initiator shift register requires data from the Initiator Interface                        FIFO and the IFE bit is asserted.          0=No underrun detected.          R/WC. Position */
#define HDMI_CEC_HDMICEC_ISR_UNDRN_Msk        (0x1U << HDMI_CEC_HDMICEC_ISR_UNDRN_Pos)       /**< (HDMI_CEC_HDMICEC_ISR) Initiator Underrun (UNDRN)        1=The Initiator shift register requires data from the Initiator Interface                        FIFO and the IFE bit is asserted.          0=No underrun detected.          R/WC. Mask */
#define HDMI_CEC_HDMICEC_ISR_ACKERR_Pos       (3)                                            /**< (HDMI_CEC_HDMICEC_ISR) The Acknowledge Error bit is asserted ('1') when the follower NACKs                     an acknowledge bit, both for Follower Directed Messages and Follower                     Broadcast Messages.                     For example, in Follower Directed Messages if the follower acknowledge                     bit response is '1' this bit is '1' in Follower Broadcast Messages                     if a follower acknowledge bit response is '0' the bit is '1'. Position */
#define HDMI_CEC_HDMICEC_ISR_ACKERR_Msk       (0x1U << HDMI_CEC_HDMICEC_ISR_ACKERR_Pos)      /**< (HDMI_CEC_HDMICEC_ISR) The Acknowledge Error bit is asserted ('1') when the follower NACKs                     an acknowledge bit, both for Follower Directed Messages and Follower                     Broadcast Messages.                     For example, in Follower Directed Messages if the follower acknowledge                     bit response is '1' this bit is '1' in Follower Broadcast Messages                     if a follower acknowledge bit response is '0' the bit is '1'. Mask */
#define HDMI_CEC_HDMICEC_ISR_CE_Pos           (4)                                            /**< (HDMI_CEC_HDMICEC_ISR) The Contention Error bit is asserted ('1') when bus contention is                     detected by the Initiator Interface at any point following CEC line                     arbitration. This is likely to be a consequence of CEC Line Error                     Handling (see CEC 7.4, CEC Line Error Handling in References [1]).       R/WC. Position */
#define HDMI_CEC_HDMICEC_ISR_CE_Msk           (0x1U << HDMI_CEC_HDMICEC_ISR_CE_Pos)          /**< (HDMI_CEC_HDMICEC_ISR) The Contention Error bit is asserted ('1') when bus contention is                     detected by the Initiator Interface at any point following CEC line                     arbitration. This is likely to be a consequence of CEC Line Error                     Handling (see CEC 7.4, CEC Line Error Handling in References [1]).       R/WC. Mask */
#define HDMI_CEC_HDMICEC_ISR_IFE_Pos          (5)                                            /**< (HDMI_CEC_HDMICEC_ISR) The Initiator FIFO Empty bit is asserted ('1') when the Initiator Interface                     retrieves the last data entry from the FIFO. Position */
#define HDMI_CEC_HDMICEC_ISR_IFE_Msk          (0x1U << HDMI_CEC_HDMICEC_ISR_IFE_Pos)         /**< (HDMI_CEC_HDMICEC_ISR) The Initiator FIFO Empty bit is asserted ('1') when the Initiator Interface                     retrieves the last data entry from the FIFO. Mask */
#define HDMI_CEC_HDMICEC_ISR_IFDONE_Pos       (6)                                            /**< (HDMI_CEC_HDMICEC_ISR) The Initiator Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been transferred by the Initiator                     Interface, or the message frame has been terminated because an                     error occurred as defined by the LAB, UNDRN, ACKERR, and CE bits.        R/WC. Position */
#define HDMI_CEC_HDMICEC_ISR_IFDONE_Msk       (0x1U << HDMI_CEC_HDMICEC_ISR_IFDONE_Pos)      /**< (HDMI_CEC_HDMICEC_ISR) The Initiator Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been transferred by the Initiator                     Interface, or the message frame has been terminated because an                     error occurred as defined by the LAB, UNDRN, ACKERR, and CE bits.        R/WC. Mask */
#define HDMI_CEC_HDMICEC_ISR_Msk              (0x0000007FUL)                                 /**< (HDMI_CEC_HDMICEC_ISR) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_FSR : (HDMI_CEC Offset: 0x14) (R/W 8) HDMI CEC Follower Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. -------- */

typedef union
{
  struct
  {
    uint8_t  OVRN:1;                    /**< bit:      0  The Follower Overrun bit is asserted ('1') when data from the follower                     shift register is transferred to the Follower Interface FIFO when                     the FFF bit is asserted.                     R/WC. */
    uint8_t  BERR:1;                    /**< bit:      1  The Bus Error Detected bit is asserted ('1') when the follower detects                    spurious pulses on the CEC Bus.                     R/WC. */
    uint8_t  BTO:1;                     /**< bit:      2  The Bus Time Out Detected bit is asserted ('1') when the follower                        detects that the CEC Bus is held high too long          R/WC. */
    uint8_t  FFNE:1;                    /**< bit:      3  The Follower FIFO Not Empty bit is asserted ('1') when there is data                         in the Follower Interface FIFO. The bit is not asserted ('0') when                         the Follower Interface FIFO is empty. */
    uint8_t  FFF:1;                     /**< bit:      4  The Follower FIFO Full bit is asserted ('1') when there is no room in                         the Follower Interface FIFO for more data. */
    uint8_t  FDR:1;                     /**< bit:      5  The Follower Data Ready bit is asserted ('1') whenever received                        data is written to the Follower Interface FIFO.          R/WC. */
    uint8_t  FFDONE:1;                  /**< bit:      6  The Follower Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been received by the Follower                     Interface, or the message frame has been terminated because an                     error occurred as defined by the OVRN, BERR, and BTO bits.       R/WC. */
    uint8_t  :1;                        /**< bit:      7  Reserved                                      */
  };
  uint8_t  w;
} __HDMI_CEC_HDMICEC_FSR_bits_t;
#define HDMI_CEC_HDMICEC_FSR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_FSR) HDMI CEC Follower Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.  Reset Value */

