ranjithaguna/pv/LED_Demo/source/pic32cx/component/hdmi_cec.h
#define HDMI_CEC_HDMICEC_FSR_OVRN_Pos         (0)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Follower Overrun bit is asserted ('1') when data from the follower                     shift register is transferred to the Follower Interface FIFO when                     the FFF bit is asserted.                     R/WC. Position */
#define HDMI_CEC_HDMICEC_FSR_OVRN_Msk         (0x1U << HDMI_CEC_HDMICEC_FSR_OVRN_Pos)        /**< (HDMI_CEC_HDMICEC_FSR) The Follower Overrun bit is asserted ('1') when data from the follower                     shift register is transferred to the Follower Interface FIFO when                     the FFF bit is asserted.                     R/WC. Mask */
#define HDMI_CEC_HDMICEC_FSR_BERR_Pos         (1)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Bus Error Detected bit is asserted ('1') when the follower detects                    spurious pulses on the CEC Bus.                     R/WC. Position */
#define HDMI_CEC_HDMICEC_FSR_BERR_Msk         (0x1U << HDMI_CEC_HDMICEC_FSR_BERR_Pos)        /**< (HDMI_CEC_HDMICEC_FSR) The Bus Error Detected bit is asserted ('1') when the follower detects                    spurious pulses on the CEC Bus.                     R/WC. Mask */
#define HDMI_CEC_HDMICEC_FSR_BTO_Pos          (2)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Bus Time Out Detected bit is asserted ('1') when the follower                        detects that the CEC Bus is held high too long          R/WC. Position */
#define HDMI_CEC_HDMICEC_FSR_BTO_Msk          (0x1U << HDMI_CEC_HDMICEC_FSR_BTO_Pos)         /**< (HDMI_CEC_HDMICEC_FSR) The Bus Time Out Detected bit is asserted ('1') when the follower                        detects that the CEC Bus is held high too long          R/WC. Mask */
#define HDMI_CEC_HDMICEC_FSR_FFNE_Pos         (3)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Follower FIFO Not Empty bit is asserted ('1') when there is data                         in the Follower Interface FIFO. The bit is not asserted ('0') when                         the Follower Interface FIFO is empty. Position */
#define HDMI_CEC_HDMICEC_FSR_FFNE_Msk         (0x1U << HDMI_CEC_HDMICEC_FSR_FFNE_Pos)        /**< (HDMI_CEC_HDMICEC_FSR) The Follower FIFO Not Empty bit is asserted ('1') when there is data                         in the Follower Interface FIFO. The bit is not asserted ('0') when                         the Follower Interface FIFO is empty. Mask */
#define HDMI_CEC_HDMICEC_FSR_FFF_Pos          (4)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Follower FIFO Full bit is asserted ('1') when there is no room in                         the Follower Interface FIFO for more data. Position */
#define HDMI_CEC_HDMICEC_FSR_FFF_Msk          (0x1U << HDMI_CEC_HDMICEC_FSR_FFF_Pos)         /**< (HDMI_CEC_HDMICEC_FSR) The Follower FIFO Full bit is asserted ('1') when there is no room in                         the Follower Interface FIFO for more data. Mask */
#define HDMI_CEC_HDMICEC_FSR_FDR_Pos          (5)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Follower Data Ready bit is asserted ('1') whenever received                        data is written to the Follower Interface FIFO.          R/WC. Position */
#define HDMI_CEC_HDMICEC_FSR_FDR_Msk          (0x1U << HDMI_CEC_HDMICEC_FSR_FDR_Pos)         /**< (HDMI_CEC_HDMICEC_FSR) The Follower Data Ready bit is asserted ('1') whenever received                        data is written to the Follower Interface FIFO.          R/WC. Mask */
#define HDMI_CEC_HDMICEC_FSR_FFDONE_Pos       (6)                                            /**< (HDMI_CEC_HDMICEC_FSR) The Follower Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been received by the Follower                     Interface, or the message frame has been terminated because an                     error occurred as defined by the OVRN, BERR, and BTO bits.       R/WC. Position */
#define HDMI_CEC_HDMICEC_FSR_FFDONE_Msk       (0x1U << HDMI_CEC_HDMICEC_FSR_FFDONE_Pos)      /**< (HDMI_CEC_HDMICEC_FSR) The Follower Frame Done bit is asserted ('1') when a message block                     with the EOM bit asserted ('1') has been received by the Follower                     Interface, or the message frame has been terminated because an                     error occurred as defined by the OVRN, BERR, and BTO bits.       R/WC. Mask */
#define HDMI_CEC_HDMICEC_FSR_Msk              (0x0000007FUL)                                 /**< (HDMI_CEC_HDMICEC_FSR) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_ICR : (HDMI_CEC Offset: 0x18) (R/W 8) HDMI CEC Initiator Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. -------- */

typedef union
{
  struct
  {
    uint8_t  IFLUSH:1;                  /**< bit:      0  When this bit is asserted ('1'), data in the Initiator Interface FIFO is       cleared. When set, the bit is automatically cleared by hardware within one        register access cycle.                     This bit can be used to terminate an Initiator Interface message frame transfer.                     R/WC. */
    uint8_t  START:1;                   /**< bit:      1  When this bit is asserted ('1'), the Initiator Interface begins a message                    frame transfer if the IFE bit is not asserted. If the Initiator                    Interface FIFO is empty when this bit is asserted, the message                    frame transfer begins as soon as a write to the Initiator Data Register                    occurs. In both cases, the bit is automatically cleared by hardware                    within one register access cycle.                    The START bit only needs to be asserted once per message frame.                    R/WC. */
    uint8_t  :3;                        /**< bit:   2..4  Reserved                                      */
    uint8_t  IFE_EN:1;                  /**< bit:      5  Enable bit for the IFE interrupt.                        1=Interrupt is enabled with IFE is asserted                        0=Interrupt is disabled          R/WC. */
    uint8_t  IFDONE_EN:1;               /**< bit:      6  Enable bit for the IFDONE interrupt.                        1=Interrupt is enabled with IFDONE is asserted                        0=Interrupt is disabled          R/WC. */
    uint8_t  :1;                        /**< bit:      7  Reserved                                      */
  };
  uint8_t  w;
} __HDMI_CEC_HDMICEC_ICR_bits_t;
#define HDMI_CEC_HDMICEC_ICR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_ICR) HDMI CEC Initiator Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.  Reset Value */

