ranjithaguna/pv/LED_Demo/source/pic32cx/component/hdmi_cec.h
#define HDMI_CEC_HDMICEC_ICR_IFLUSH_Pos       (0)                                            /**< (HDMI_CEC_HDMICEC_ICR) When this bit is asserted ('1'), data in the Initiator Interface FIFO is       cleared. When set, the bit is automatically cleared by hardware within one        register access cycle.                     This bit can be used to terminate an Initiator Interface message frame transfer.                     R/WC. Position */
#define HDMI_CEC_HDMICEC_ICR_IFLUSH_Msk       (0x1U << HDMI_CEC_HDMICEC_ICR_IFLUSH_Pos)      /**< (HDMI_CEC_HDMICEC_ICR) When this bit is asserted ('1'), data in the Initiator Interface FIFO is       cleared. When set, the bit is automatically cleared by hardware within one        register access cycle.                     This bit can be used to terminate an Initiator Interface message frame transfer.                     R/WC. Mask */
#define HDMI_CEC_HDMICEC_ICR_START_Pos        (1)                                            /**< (HDMI_CEC_HDMICEC_ICR) When this bit is asserted ('1'), the Initiator Interface begins a message                    frame transfer if the IFE bit is not asserted. If the Initiator                    Interface FIFO is empty when this bit is asserted, the message                    frame transfer begins as soon as a write to the Initiator Data Register                    occurs. In both cases, the bit is automatically cleared by hardware                    within one register access cycle.                    The START bit only needs to be asserted once per message frame.                    R/WC. Position */
#define HDMI_CEC_HDMICEC_ICR_START_Msk        (0x1U << HDMI_CEC_HDMICEC_ICR_START_Pos)       /**< (HDMI_CEC_HDMICEC_ICR) When this bit is asserted ('1'), the Initiator Interface begins a message                    frame transfer if the IFE bit is not asserted. If the Initiator                    Interface FIFO is empty when this bit is asserted, the message                    frame transfer begins as soon as a write to the Initiator Data Register                    occurs. In both cases, the bit is automatically cleared by hardware                    within one register access cycle.                    The START bit only needs to be asserted once per message frame.                    R/WC. Mask */
#define HDMI_CEC_HDMICEC_ICR_IFE_EN_Pos       (5)                                            /**< (HDMI_CEC_HDMICEC_ICR) Enable bit for the IFE interrupt.                        1=Interrupt is enabled with IFE is asserted                        0=Interrupt is disabled          R/WC. Position */
#define HDMI_CEC_HDMICEC_ICR_IFE_EN_Msk       (0x1U << HDMI_CEC_HDMICEC_ICR_IFE_EN_Pos)      /**< (HDMI_CEC_HDMICEC_ICR) Enable bit for the IFE interrupt.                        1=Interrupt is enabled with IFE is asserted                        0=Interrupt is disabled          R/WC. Mask */
#define HDMI_CEC_HDMICEC_ICR_IFDONE_EN_Pos    (6)                                            /**< (HDMI_CEC_HDMICEC_ICR) Enable bit for the IFDONE interrupt.                        1=Interrupt is enabled with IFDONE is asserted                        0=Interrupt is disabled          R/WC. Position */
#define HDMI_CEC_HDMICEC_ICR_IFDONE_EN_Msk    (0x1U << HDMI_CEC_HDMICEC_ICR_IFDONE_EN_Pos)   /**< (HDMI_CEC_HDMICEC_ICR) Enable bit for the IFDONE interrupt.                        1=Interrupt is enabled with IFDONE is asserted                        0=Interrupt is disabled          R/WC. Mask */
#define HDMI_CEC_HDMICEC_ICR_Msk              (0x00000063UL)                                 /**< (HDMI_CEC_HDMICEC_ICR) Register Mask  */

/* -------- HDMI_CEC_HDMICEC_FCR : (HDMI_CEC Offset: 0x1c) (R/W 8) HDMI CEC Follower Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. -------- */

typedef union
{
  struct
  {
    uint8_t  FFLUSH:1;                  /**< bit:      0  When this bit is asserted ('1'), data in the Follower Interface FIFO is                     cleared. When set, the bit is automatically cleared by hardware                     within one register access cycle.                      R/WC. */
    uint8_t  :3;                        /**< bit:   1..3  Reserved                                      */
    uint8_t  FFF_EN:1;                  /**< bit:      4  Enable bit for the FFF interrupt.                    1=Interrupt is enabled with FFF is asserted                    0=Interrupt is disabled                    R/WC. */
    uint8_t  FDR_EN:1;                  /**< bit:      5  Enable bit for the FDR interrupt.                        1=Interrupt is enabled with FDR is asserted                        0=Interrupt is disabled          R/WC. */
    uint8_t  FFDONE_EN:1;               /**< bit:      6  Enable bit for the FFDONE interrupt.                        1=Interrupt is enabled with FFDONE is asserted                        0=Interrupt is disabled          R/WC. */
    uint8_t  :1;                        /**< bit:      7  Reserved                                      */
  };
  uint8_t  w;
} __HDMI_CEC_HDMICEC_FCR_bits_t;
#define HDMI_CEC_HDMICEC_FCR_RESETVALUE     (0x00U)                                       /**<  (HDMI_CEC_HDMICEC_FCR) HDMI CEC Follower Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved.  Reset Value */

#define HDMI_CEC_HDMICEC_FCR_FFLUSH_Pos       (0)                                            /**< (HDMI_CEC_HDMICEC_FCR) When this bit is asserted ('1'), data in the Follower Interface FIFO is                     cleared. When set, the bit is automatically cleared by hardware                     within one register access cycle.                      R/WC. Position */
#define HDMI_CEC_HDMICEC_FCR_FFLUSH_Msk       (0x1U << HDMI_CEC_HDMICEC_FCR_FFLUSH_Pos)      /**< (HDMI_CEC_HDMICEC_FCR) When this bit is asserted ('1'), data in the Follower Interface FIFO is                     cleared. When set, the bit is automatically cleared by hardware                     within one register access cycle.                      R/WC. Mask */
#define HDMI_CEC_HDMICEC_FCR_FFF_EN_Pos       (4)                                            /**< (HDMI_CEC_HDMICEC_FCR) Enable bit for the FFF interrupt.                    1=Interrupt is enabled with FFF is asserted                    0=Interrupt is disabled                    R/WC. Position */
#define HDMI_CEC_HDMICEC_FCR_FFF_EN_Msk       (0x1U << HDMI_CEC_HDMICEC_FCR_FFF_EN_Pos)      /**< (HDMI_CEC_HDMICEC_FCR) Enable bit for the FFF interrupt.                    1=Interrupt is enabled with FFF is asserted                    0=Interrupt is disabled                    R/WC. Mask */
#define HDMI_CEC_HDMICEC_FCR_FDR_EN_Pos       (5)                                            /**< (HDMI_CEC_HDMICEC_FCR) Enable bit for the FDR interrupt.                        1=Interrupt is enabled with FDR is asserted                        0=Interrupt is disabled          R/WC. Position */
#define HDMI_CEC_HDMICEC_FCR_FDR_EN_Msk       (0x1U << HDMI_CEC_HDMICEC_FCR_FDR_EN_Pos)      /**< (HDMI_CEC_HDMICEC_FCR) Enable bit for the FDR interrupt.                        1=Interrupt is enabled with FDR is asserted                        0=Interrupt is disabled          R/WC. Mask */
#define HDMI_CEC_HDMICEC_FCR_FFDONE_EN_Pos    (6)                                            /**< (HDMI_CEC_HDMICEC_FCR) Enable bit for the FFDONE interrupt.                        1=Interrupt is enabled with FFDONE is asserted                        0=Interrupt is disabled          R/WC. Position */
#define HDMI_CEC_HDMICEC_FCR_FFDONE_EN_Msk    (0x1U << HDMI_CEC_HDMICEC_FCR_FFDONE_EN_Pos)   /**< (HDMI_CEC_HDMICEC_FCR) Enable bit for the FFDONE interrupt.                        1=Interrupt is enabled with FFDONE is asserted                        0=Interrupt is disabled          R/WC. Mask */
#define HDMI_CEC_HDMICEC_FCR_Msk              (0x00000071UL)                                 /**< (HDMI_CEC_HDMICEC_FCR) Register Mask  */

