ranjithaguna/pv/LED_Demo/source/pic32cx/component/hdmi_cec.h
/* -------- HDMI_CEC_HDMICEC_DIV : (HDMI_CEC Offset: 0x20) (R/W 32) HDMI CEC Clock Divier Register.\n    Reset value of this reister is 0x01E0.\n -------- */

typedef union
{
  struct
  {
    uint32_t CLK_DIV:32;                /**< bit:  0..31  HDMI CEC Clock Divier Register.\n             */
  };
  uint32_t w;
} __HDMI_CEC_HDMICEC_DIV_bits_t;
#define HDMI_CEC_HDMICEC_DIV_RESETVALUE     (0x1E0U)                                      /**<  (HDMI_CEC_HDMICEC_DIV) HDMI CEC Clock Divier Register.\n    Reset value of this reister is 0x01E0.\n  Reset Value */

#define HDMI_CEC_HDMICEC_DIV_CLK_DIV_Pos      (0)                                            /**< (HDMI_CEC_HDMICEC_DIV) HDMI CEC Clock Divier Register.\n Position */
#define HDMI_CEC_HDMICEC_DIV_CLK_DIV_Msk      (0xFFFFFFFFU << HDMI_CEC_HDMICEC_DIV_CLK_DIV_Pos)  /**< (HDMI_CEC_HDMICEC_DIV) HDMI CEC Clock Divier Register.\n Mask */
#define HDMI_CEC_HDMICEC_DIV_CLK_DIV(value)   (HDMI_CEC_HDMICEC_DIV_CLK_DIV_Msk & ((value) << HDMI_CEC_HDMICEC_DIV_CLK_DIV_Pos))
#define HDMI_CEC_HDMICEC_DIV_Msk              (0xFFFFFFFFUL)                                 /**< (HDMI_CEC_HDMICEC_DIV) Register Mask  */

/** \brief HDMI_CEC register offsets definitions */
#define HDMI_CEC_HDMICEC_CTRL_OFFSET (0x00)         /**< (HDMI_CEC_HDMICEC_CTRL) HDMI CEC Control Register.     Only bits [3:0] are used. Bits [31:4] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_LAR_OFFSET  (0x04)         /**< (HDMI_CEC_HDMICEC_LAR) HDMI CEC Claimed Logical Address Register.     Only bits [15:0] are used. Bits [31:16] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_IDR_OFFSET  (0x08)         /**< (HDMI_CEC_HDMICEC_IDR) HDMI CEC Initiator Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_FDR_OFFSET  (0x0C)         /**< (HDMI_CEC_HDMICEC_FDR) HDMI CEC Follower Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_ISR_OFFSET  (0x10)         /**< (HDMI_CEC_HDMICEC_ISR) HDMI CEC Initiator Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_FSR_OFFSET  (0x14)         /**< (HDMI_CEC_HDMICEC_FSR) HDMI CEC Follower Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_ICR_OFFSET  (0x18)         /**< (HDMI_CEC_HDMICEC_ICR) HDMI CEC Initiator Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_FCR_OFFSET  (0x1C)         /**< (HDMI_CEC_HDMICEC_FCR) HDMI CEC Follower Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. Offset */
#define HDMI_CEC_HDMICEC_DIV_OFFSET  (0x20)         /**< (HDMI_CEC_HDMICEC_DIV) HDMI CEC Clock Divier Register.\n    Reset value of this reister is 0x01E0.\n Offset */

/** \brief HDMI_CEC register API structure */
typedef struct
{  /* The HDMI Consumer Electronics Control (CEC) Interface that provides high-level control functions between all of the        various audiovisual products in a users environment. */
  __IO  __HDMI_CEC_HDMICEC_CTRL_bits_t HDMICEC_CTRL;  /**< Offset: 0x00 (R/W   8) HDMI CEC Control Register.     Only bits [3:0] are used. Bits [31:4] are Reserved. */
  __I   __HDMI_CEC_HDMICEC_LAR_bits_t  HDMICEC_LAR;   /**< Offset: 0x04 (R/   16) HDMI CEC Claimed Logical Address Register.     Only bits [15:0] are used. Bits [31:16] are Reserved. */
  __O   __HDMI_CEC_HDMICEC_IDR_bits_t  HDMICEC_IDR;   /**< Offset: 0x08 ( /W  16) HDMI CEC Initiator Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved. */
  __I   __HDMI_CEC_HDMICEC_FDR_bits_t  HDMICEC_FDR;   /**< Offset: 0x0C (R/   16) HDMI CEC Follower Data Register.     Only bits [8:0] are used. Bits [31:9] are Reserved. */
  __IO  __HDMI_CEC_HDMICEC_ISR_bits_t  HDMICEC_ISR;   /**< Offset: 0x10 (R/W   8) HDMI CEC Initiator Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. */
  __IO  __HDMI_CEC_HDMICEC_FSR_bits_t  HDMICEC_FSR;   /**< Offset: 0x14 (R/W   8) HDMI CEC Follower Status Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. */
  __IO  __HDMI_CEC_HDMICEC_ICR_bits_t  HDMICEC_ICR;   /**< Offset: 0x18 (R/W   8) HDMI CEC Initiator Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. */
  __IO  __HDMI_CEC_HDMICEC_FCR_bits_t  HDMICEC_FCR;   /**< Offset: 0x1C (R/W   8) HDMI CEC Follower Control Register.     Only bits [6:0] are used. Bits [31:7] are Reserved. */
  __IO  __HDMI_CEC_HDMICEC_DIV_bits_t  HDMICEC_DIV;   /**< Offset: 0x20 (R/W  32) HDMI CEC Clock Divier Register.\n    Reset value of this reister is 0x01E0.\n */
} hdmicec_registers_t;
/** @}  end of The HDMI Consumer Electronics Control (CEC) Interface that provides high-level control functions between all of the        various audiovisual products in a users environment. */

#endif /* _PIC32CX_0525SG12_HDMI_CEC_COMPONENT_H_ */
